; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v8 ?v11)
             (pred_11 ?v4 ?v13)
             (pred_10 ?v8 ?v13)
             (pred_7 ?v10 ?v8 )
	     (pred_5 ?v8)
             (pred_8 ?v3)
             (pred_6 ?v4)
             (pred_9 ?v13)
             (pred_4 ?v8)
             (pred_1 ?v4)
             (pred_2 ?v8)
             (pred_3 ))



(:action op_4
:parameters (?v2 ?v12 ?v6 ?v1)
:precondition (and (pred_8 ?v2) (pred_8 ?v12) (pred_6 ?v6) (pred_9 ?v1)
          (pred_12 ?v2 ?v12) (pred_11 ?v6 ?v1)
                   (pred_10 ?v12 ?v1) (pred_5 ?v2) 
                   (pred_4 ?v12) (pred_1 ?v6))
:effect (and  (pred_2 ?v12) (not (pred_4 ?v12))))


(:action op_1
:parameters (?v2 ?v7)
:precondition (and (pred_8 ?v2) (pred_8 ?v7)
               (pred_5 ?v2) (pred_12 ?v2 ?v7) (pred_2 ?v7))
:effect (and (pred_5 ?v7) (not (pred_5 ?v2))))

(:action op_3
:parameters (?v2 ?v6)
:precondition (and (pred_8 ?v2) (pred_6 ?v6) 
                  (pred_5 ?v2) (pred_7 ?v6 ?v2) (pred_3 ))
:effect (and (pred_1 ?v6)
   (not (pred_7 ?v6 ?v2)) (not (pred_3 ))))


(:action op_5
:parameters (?v2 ?v9 ?v5)
:precondition (and (pred_8 ?v2) (pred_6 ?v9) (pred_6 ?v5)
                  (pred_5 ?v2) (pred_1 ?v5) (pred_7 ?v9 ?v2))
:effect (and (pred_1 ?v9) (pred_7 ?v5 ?v2)
        (not (pred_1 ?v5)) (not (pred_7 ?v9 ?v2))))

(:action op_2
:parameters (?v2 ?v6)
:precondition (and (pred_8 ?v2) (pred_6 ?v6) 
                  (pred_5 ?v2) (pred_1 ?v6))
:effect (and (pred_3 ) (pred_7 ?v6 ?v2) (not (pred_1 ?v6)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_22 obj_01 obj_24 obj_16 obj_15 obj_05 obj_12 obj_17 obj_30 obj_31 obj_13 obj_14 obj_26 obj_32 obj_10 obj_18 obj_25 obj_29 obj_21 obj_09 obj_08 obj_27 obj_04 obj_07 obj_11
    obj_03 obj_20 obj_06
    obj_19 obj_23 obj_28 obj_02
    )

    (:init
       (pred_3)

       (pred_8 obj_22)
       (pred_8 obj_01)
       (pred_8 obj_24)
       (pred_8 obj_16)
       (pred_8 obj_15)
       (pred_8 obj_05)
       (pred_8 obj_12)
       (pred_8 obj_17)
       (pred_8 obj_30)
       (pred_8 obj_31)
       (pred_8 obj_13)
       (pred_8 obj_14)
       (pred_8 obj_26)
       (pred_8 obj_32)
       (pred_8 obj_10)
       (pred_8 obj_18)
       (pred_8 obj_25)
       (pred_8 obj_29)
       (pred_8 obj_21)
       (pred_8 obj_09)
       (pred_8 obj_08)
       (pred_8 obj_27)
       (pred_8 obj_04)
       (pred_8 obj_07)
       (pred_8 obj_11)
       (pred_9 obj_03)
       (pred_9 obj_20)
       (pred_9 obj_06)
       (pred_6 obj_19)
       (pred_6 obj_23)
       (pred_6 obj_28)
       (pred_6 obj_02)

       (pred_12 obj_22 obj_05)
       (pred_12 obj_22 obj_01)
       (pred_12 obj_01 obj_12)
       (pred_12 obj_01 obj_24)
       (pred_12 obj_01 obj_22)
       (pred_12 obj_24 obj_17)
       (pred_12 obj_24 obj_16)
       (pred_12 obj_24 obj_01)
       (pred_12 obj_16 obj_30)
       (pred_12 obj_16 obj_15)
       (pred_12 obj_16 obj_24)
       (pred_12 obj_15 obj_31)
       (pred_12 obj_15 obj_16)
       (pred_12 obj_05 obj_13)
       (pred_12 obj_05 obj_12)
       (pred_12 obj_05 obj_22)
       (pred_12 obj_12 obj_14)
       (pred_12 obj_12 obj_17)
       (pred_12 obj_12 obj_01)
       (pred_12 obj_12 obj_05)
       (pred_12 obj_17 obj_26)
       (pred_12 obj_17 obj_30)
       (pred_12 obj_17 obj_24)
       (pred_12 obj_17 obj_12)
       (pred_12 obj_30 obj_32)
       (pred_12 obj_30 obj_31)
       (pred_12 obj_30 obj_16)
       (pred_12 obj_30 obj_17)
       (pred_12 obj_31 obj_10)
       (pred_12 obj_31 obj_15)
       (pred_12 obj_31 obj_30)
       (pred_12 obj_13 obj_18)
       (pred_12 obj_13 obj_14)
       (pred_12 obj_13 obj_05)
       (pred_12 obj_14 obj_25)
       (pred_12 obj_14 obj_26)
       (pred_12 obj_14 obj_12)
       (pred_12 obj_14 obj_13)
       (pred_12 obj_26 obj_29)
       (pred_12 obj_26 obj_32)
       (pred_12 obj_26 obj_17)
       (pred_12 obj_26 obj_14)
       (pred_12 obj_32 obj_21)
       (pred_12 obj_32 obj_10)
       (pred_12 obj_32 obj_30)
       (pred_12 obj_32 obj_26)
       (pred_12 obj_10 obj_09)
       (pred_12 obj_10 obj_31)
       (pred_12 obj_10 obj_32)
       (pred_12 obj_18 obj_08)
       (pred_12 obj_18 obj_25)
       (pred_12 obj_18 obj_13)
       (pred_12 obj_25 obj_27)
       (pred_12 obj_25 obj_29)
       (pred_12 obj_25 obj_14)
       (pred_12 obj_25 obj_18)
       (pred_12 obj_29 obj_04)
       (pred_12 obj_29 obj_21)
       (pred_12 obj_29 obj_26)
       (pred_12 obj_29 obj_25)
       (pred_12 obj_21 obj_07)
       (pred_12 obj_21 obj_09)
       (pred_12 obj_21 obj_32)
       (pred_12 obj_21 obj_29)
       (pred_12 obj_09 obj_11)
       (pred_12 obj_09 obj_10)
       (pred_12 obj_09 obj_21)
       (pred_12 obj_08 obj_27)
       (pred_12 obj_08 obj_18)
       (pred_12 obj_27 obj_04)
       (pred_12 obj_27 obj_25)
       (pred_12 obj_27 obj_08)
       (pred_12 obj_04 obj_07)
       (pred_12 obj_04 obj_29)
       (pred_12 obj_04 obj_27)
       (pred_12 obj_07 obj_11)
       (pred_12 obj_07 obj_21)
       (pred_12 obj_07 obj_04)
       (pred_12 obj_11 obj_09)
       (pred_12 obj_11 obj_07)
       (pred_4 obj_30)
       (pred_4 obj_16)
       (pred_4 obj_32)
       (pred_4 obj_18)
       (pred_10  obj_30 obj_03)
       (pred_10  obj_16 obj_20)
       (pred_10  obj_32 obj_06)
       (pred_10  obj_18 obj_20)
       (pred_2 obj_22)
       (pred_2 obj_01)
       (pred_2 obj_24)
       (pred_2 obj_15)
       (pred_2 obj_05)
       (pred_2 obj_12)
       (pred_2 obj_17)
       (pred_2 obj_31)
       (pred_2 obj_13)
       (pred_2 obj_14)
       (pred_2 obj_26)
       (pred_2 obj_10)
       (pred_2 obj_25)
       (pred_2 obj_29)
       (pred_2 obj_21)
       (pred_2 obj_09)
       (pred_2 obj_08)
       (pred_2 obj_27)
       (pred_2 obj_04)
       (pred_2 obj_07)
       (pred_2 obj_11)

       (pred_11  obj_19 obj_03)
       (pred_11  obj_23 obj_20)
       (pred_11  obj_28 obj_06)
       (pred_11  obj_02 obj_20)
       (pred_7 obj_19 obj_26)
       (pred_7 obj_23 obj_25)
       (pred_7 obj_28 obj_26)
       (pred_7 obj_02 obj_04)
       (pred_5 obj_17)
    )

    (:goal (and
       (pred_7 obj_23 obj_08)
       (pred_7 obj_02 obj_21)
    ))
(:constraints
  (always (not (pred_5 obj_29)))
)
)

; plan
1. (op_1 obj_17 obj_26)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_26)
   goals met: 0 of 2
2. (op_1 obj_26 obj_14)
   deleted: (pred_5 obj_26)
   added: (pred_5 obj_14)
   goals met: 0 of 2
3. (op_1 obj_14 obj_25)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_25)
   goals met: 0 of 2
4. (op_1 obj_25 obj_27)
   deleted: (pred_5 obj_25)
   added: (pred_5 obj_27)
   goals met: 0 of 2
5. (op_1 obj_27 obj_04)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_04)
   goals met: 0 of 2
6. (op_3 obj_04 obj_02)
   deleted: (pred_7 obj_02 obj_04) (pred_3)
   added: (pred_1 obj_02)
   goals met: 0 of 2
7. (op_1 obj_04 obj_27)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_27)
   goals met: 0 of 2
8. (op_1 obj_27 obj_25)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_25)
   goals met: 0 of 2
9. (op_5 obj_25 obj_23 obj_02)
   deleted: (pred_1 obj_02) (pred_7 obj_23 obj_25)
   added: (pred_1 obj_23) (pred_7 obj_02 obj_25)
   goals met: 0 of 2
10. (op_1 obj_25 obj_27)
   deleted: (pred_5 obj_25)
   added: (pred_5 obj_27)
   goals met: 0 of 2
11. (op_1 obj_27 obj_08)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_08)
   goals met: 0 of 2
12. (op_2 obj_08 obj_23)
   deleted: (pred_1 obj_23)
   added: (pred_3) (pred_7 obj_23 obj_08)
   goals met: 1 of 2
13. (op_1 obj_08 obj_27)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_27)
   goals met: 1 of 2
14. (op_1 obj_27 obj_25)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_25)
   goals met: 1 of 2
15. (op_3 obj_25 obj_02)
   deleted: (pred_7 obj_02 obj_25) (pred_3)
   added: (pred_1 obj_02)
   goals met: 1 of 2
16. (op_1 obj_25 obj_27)
   deleted: (pred_5 obj_25)
   added: (pred_5 obj_27)
   goals met: 1 of 2
17. (op_1 obj_27 obj_04)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_04)
   goals met: 1 of 2
18. (op_1 obj_04 obj_07)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_07)
   goals met: 1 of 2
19. (op_1 obj_07 obj_21)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_21)
   goals met: 1 of 2
20. (op_2 obj_21 obj_02)
   deleted: (pred_1 obj_02)
   added: (pred_3) (pred_7 obj_02 obj_21)
   goals met: 2 of 2
